const ChartData = [
    {
      'name': 'فروردین',
      'فروش': 100,
    
    },
    {
      'name': 'اردیبهشت',
      'فروش': 900,
   
    },
    {
      'name': 'خرداد',
      'فروش': 700,
     
    },
    {
      'name': 'تیر',
      'فروش': 1600,
    
    },
    {
      'name': 'مرداد',
      'فروش': 3000,
     
    },
    {
      'name': 'شهریور',
      'فروش': 2100,
     
    },
    {
      'name': 'مهر',
      'فروش': 800,
     
    },
    {
      'name': 'آبان',
      'فروش': 2300,
   
    },
    {
      'name': 'آذر',
      'فروش': 2000,
     
    },
    {
      'name': 'دی',
      'فروش': 1200,
      
    },
    {
      'name': 'بهمن',
      'فروش': 800,
      
    },
    {
      'name': 'اسفند',
      'فروش': 1500,
      
    },
  ];
const ChartData2 = [
   
    {
      'name': 'تیر',
      'فروش': 200,
     
    },
    {
      'name': 'مرداد',
      'فروش': 300,
     
    },
    {
      'name': 'شهریور',
      'فروش': 1000,
     
    },
    {
      'name': 'مهر',
      'فروش': 100,
     
    },

  ];
const ChartData3 = [
  {
    name: 'فروردین',
    بازدید: 4000,
    pv: 2400,
    amt: 2400,
  },
  {
    name: 'اردیبهشت',
    بازدید: 3000,
    pv: 1398,
    amt: 2210,
  },
  {
    name: 'خرداد',
    بازدید: 2000,
    pv: 9800,
    amt: 2290,
  },
  {
    name: 'تیر',
    بازدید: 2780,
    pv: 3908,
    amt: 2000,
  },
  {
    name: 'مرداد',
    بازدید: 1890,
    pv: 4800,
    amt: 2181,
  },
  {
    name: 'شهریور',
    بازدید: 2390,
    pv: 3800,
    amt: 2500,
  },
 
];
const ChartData4 = [
  {
    name: 'فروردین',
    uv: 4000,
    pv: 2400,
    amt: 2400,
  },
  {
    name: 'اردیبهشت',
    uv: 3000,
    pv: 1398,
    amt: 2210,
  },
  {
    name: 'خرداد',
    uv: 2000,
    pv: 9800,
    amt: 2290,
  },
  {
    name: 'تیر',
    uv: 2780,
    pv: 3908,
    amt: 2000,
  },
  {
    name: 'مرداد',
    uv: 1890,
    pv: 4800,
    amt: 2181,
  },
  {
    name: 'شهریور',
    uv: 2390,
    pv: 3800,
    amt: 2500,
  },
 
];
const ChartData5 = [
  {
    name: 'فروردین',
    uv: 1000,
    pv: 2400,
    amt: 2400,
  },
  {
    name: 'اردیبهشت',
    uv: 1300,
    pv: 1398,
    amt: 2210,
  },
  {
    name: 'خرداد',
    uv: 800,
    pv: 9800,
    amt: 2290,
  },
  {
    name: 'تیر',
    uv: 1500,
    pv: 3908,
    amt: 2000,
  },
  {
    name: 'مرداد',
    uv: 1100,
    pv: 4800,
    amt: 2181,
  },
  {
    name: 'شهریور',
    uv: 1890,
    pv: 3800,
    amt: 2500,
  },
 
];
const ChartData6 = [
  {
    name: 'فروردین',
    uv: 600,
    pv: 2400,
    amt: 2400,
  },
  {
    name: 'اردیبهشت',
    uv: 400,
    pv: 1398,
    amt: 2210,
  },
  {
    name: 'خرداد',
    uv: 800,
    pv: 9800,
    amt: 2290,
  },
  {
    name: 'تیر',
    uv: 1000,
    pv: 3908,
    amt: 2000,
  },
  {
    name: 'مرداد',
    uv: 900,
    pv: 4800,
    amt: 2181,
  },
  {
    name: 'شهریور',
    uv: 700,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'شهریور',
    uv: 200,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'شهریور',
    uv: 400,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'شهریور',
    uv: 200,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'شهریور',
    uv: 600,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'شهریور',
    uv: 800,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'شهریور',
    uv: 400,
    pv: 3800,
    amt: 2500,
  },
 
  {
    name: 'شهریور',
    uv: 300,
    pv: 3800,
    amt: 2500,
  },
 
  {
    name: 'شهریور',
    uv: 800,
    pv: 3800,
    amt: 2500,
  },
 
  {
    name: 'شهریور',
    uv: 400,
    pv: 3800,
    amt: 2500,
  },
 
];
const ChartData7 = [
  {
    name: 'فروردین',
    uv: 200,
    pv: 2400,
    amt: 2400,
  },
  {
    name: 'اردیبهشت',
    uv: 400,
    pv: 1398,
    amt: 2210,
  },
  {
    name: 'خرداد',
    uv: 350,
    pv: 9800,
    amt: 2290,
  },
  {
    name: 'تیر',
    uv: 590,
    pv: 3908,
    amt: 2000,
  },
  {
    name: 'مرداد',
    uv: 800,
    pv: 4800,
    amt: 2181,
  },
  {
    name: 'شهریور',
    uv: 600,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'مهر',
    uv: 1200,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 900,
    pv: 3800,
    amt: 2500,
  },
 
];
const ChartData8 = [
  {
    name: 'فروردین',
    uv: 200,
    pv: 2400,
    amt: 2400,
  },
  {
    name: 'اردیبهشت',
    uv: 300,
    pv: 1398,
    amt: 2210,
  },
  {
    name: 'خرداد',
    uv: 600,
    pv: 9800,
    amt: 2290,
  },
  {
    name: 'تیر',
    uv: 1300,
    pv: 3908,
    amt: 2000,
  },
  {
    name: 'مرداد',
    uv: 1500,
    pv: 4800,
    amt: 2181,
  },
  {
    name: 'شهریور',
    uv: 1100,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'مهر',
    uv: 800,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 1300,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 800,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 1000,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 800,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 1000,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 1200,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 800,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 400,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 200,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 800,
    pv: 3800,
    amt: 2500,
  },
  {
    name: 'آبان',
    uv: 500,
    pv: 3800,
    amt: 2500,
  },
 
];
  export {ChartData,ChartData2,ChartData3,ChartData4,ChartData5,ChartData6,ChartData7,ChartData8}