import React, { useState } from 'react'
import MiniChart from '../../Components/MiniChart/MiniChart'
import { ChartData, ChartData2, ChartData3, ChartData4, ChartData5, ChartData6, ChartData7, ChartData8 } from '../../Components/Chart/ChartData'
import './QReports.css'
import ComposedCharts from '../../Components/ComposedChart/ComposedCharts'
import BarCharts from '../../Components/BarChart/BarCharts'
export default function QReports() {

    const [featuresDB, setFeaturesDB] = useState([
        { id: 1, title: "سود علی الحساب", price: "7,690,000", profit_Loss: 8.2, isArrow: true, color: "#1de00b", chart: ChartData5 },
        { id: 2, title: "ضرر ماه جاری", price: "5,200,000", profit_Loss: 27.1, isArrow: false, color: "#ff1010", chart: ChartData6 },

    ])

    const data = [
        {
            name: 'فروردین',
            uv: 590,
            pv: 800,
            amt: 1400,
        },
        {
            name: 'اردیبهشت',
            uv: 868,
            pv: 967,
            amt: 1506,
        },
        {
            name: 'خرداد',
            uv: 1397,
            pv: 1098,
            amt: 989,
        },
        {
            name: 'تیر',
            uv: 1000,
            pv: 1200,
            amt: 1228,
        },
        {
            name: 'مرداد',
            uv: 1520,
            pv: 1108,
            amt: 1100,
        },
        {
            name: 'شهریور',
            uv: 1400,
            pv: 680,
            amt: 1700,
        },
    ];


    return (
        <div className='qreports-container'>
            <div className="q-report-cards">
                <div className="q-card1">


                    <h3 className="q-card-title">مشتریان</h3>


                    <div className="q-card-detail">

                        <h4 className='q-card1-num'>45.6K</h4>
                        <div className="q-chart">
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
                                <path fill="#fe9e19" fill-opacity="1" d="M0,224L18.5,224C36.9,224,74,224,111,213.3C147.7,203,185,181,222,181.3C258.5,181,295,203,332,218.7C369.2,235,406,245,443,229.3C480,213,517,171,554,154.7C590.8,139,628,149,665,170.7C701.5,192,738,224,775,245.3C812.3,267,849,277,886,288C923.1,299,960,309,997,266.7C1033.8,224,1071,128,1108,101.3C1144.6,75,1182,117,1218,138.7C1255.4,160,1292,160,1329,149.3C1366.2,139,1403,117,1422,106.7L1440,96L1440,320L1421.5,320C1403.1,320,1366,320,1329,320C1292.3,320,1255,320,1218,320C1181.5,320,1145,320,1108,320C1070.8,320,1034,320,997,320C960,320,923,320,886,320C849.2,320,812,320,775,320C738.5,320,702,320,665,320C627.7,320,591,320,554,320C516.9,320,480,320,443,320C406.2,320,369,320,332,320C295.4,320,258,320,222,320C184.6,320,148,320,111,320C73.8,320,37,320,18,320L0,320Z"></path>
                            </svg>

                        </div>
                        <h5 className="q-card1-profit">15%+</h5>
                    </div>
                </div>
                <div className="q-card2">

                    <h3 className="q-card-title">سفارش ها</h3>

                    <div className="q-card-detail">

                        <h4 className='q-card2-num'>2.5K</h4>

                        <div className="q-chart">
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
                                <path fill="#0099ff" fill-opacity="1" d="M0,256L18.5,213.3C36.9,171,74,85,111,80C147.7,75,185,149,222,197.3C258.5,245,295,267,332,250.7C369.2,235,406,181,443,181.3C480,181,517,235,554,256C590.8,277,628,267,665,224C701.5,181,738,107,775,74.7C812.3,43,849,53,886,58.7C923.1,64,960,64,997,101.3C1033.8,139,1071,213,1108,208C1144.6,203,1182,117,1218,96C1255.4,75,1292,117,1329,138.7C1366.2,160,1403,160,1422,160L1440,160L1440,320L1421.5,320C1403.1,320,1366,320,1329,320C1292.3,320,1255,320,1218,320C1181.5,320,1145,320,1108,320C1070.8,320,1034,320,997,320C960,320,923,320,886,320C849.2,320,812,320,775,320C738.5,320,702,320,665,320C627.7,320,591,320,554,320C516.9,320,480,320,443,320C406.2,320,369,320,332,320C295.4,320,258,320,222,320C184.6,320,148,320,111,320C73.8,320,37,320,18,320L0,320Z"></path>
                            </svg>

                        </div>
                        <h5 className="q-card2-profit">3%-</h5>
                    </div>
                </div>
                <div className="q-card3">

                    <h3 className="q-card-title">درآمد</h3>
                    <div className="q-card-detail">
                        <h4 className='q-card3-num'>$27.6K</h4>
                        <div className="q-chart">
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
                                <path fill="#d92100" fill-opacity="1" d="M0,224L15,234.7C30,245,60,267,90,234.7C120,203,150,117,180,80C210,43,240,53,270,69.3C300,85,330,107,360,128C390,149,420,171,450,160C480,149,510,107,540,74.7C570,43,600,21,630,37.3C660,53,690,107,720,122.7C750,139,780,117,810,122.7C840,128,870,160,900,176C930,192,960,192,990,176C1020,160,1050,128,1080,112C1110,96,1140,96,1170,133.3C1200,171,1230,245,1260,234.7C1290,224,1320,128,1350,106.7C1380,85,1410,139,1425,165.3L1440,192L1440,320L1425,320C1410,320,1380,320,1350,320C1320,320,1290,320,1260,320C1230,320,1200,320,1170,320C1140,320,1110,320,1080,320C1050,320,1020,320,990,320C960,320,930,320,900,320C870,320,840,320,810,320C780,320,750,320,720,320C690,320,660,320,630,320C600,320,570,320,540,320C510,320,480,320,450,320C420,320,390,320,360,320C330,320,300,320,270,320C240,320,210,320,180,320C150,320,120,320,90,320C60,320,30,320,15,320L0,320Z"></path>
                            </svg>
                        </div>
                        <h5 className="q-card3-profit">32%+</h5>
                    </div>
                </div>
                <div className="q-card4">
                    <h3 className="q-card-title">کاربران فعال</h3>

                    <div className="q-card-detail">

                        <h4 className='q-card4-num'>3.6K</h4>
                        <div className="q-chart">
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
                                <path fill="#4ad300" fill-opacity="1" d="M0,96L18.5,117.3C36.9,139,74,181,111,176C147.7,171,185,117,222,128C258.5,139,295,213,332,218.7C369.2,224,406,160,443,149.3C480,139,517,181,554,181.3C590.8,181,628,139,665,112C701.5,85,738,75,775,80C812.3,85,849,107,886,138.7C923.1,171,960,213,997,213.3C1033.8,213,1071,171,1108,154.7C1144.6,139,1182,149,1218,133.3C1255.4,117,1292,75,1329,64C1366.2,53,1403,75,1422,85.3L1440,96L1440,320L1421.5,320C1403.1,320,1366,320,1329,320C1292.3,320,1255,320,1218,320C1181.5,320,1145,320,1108,320C1070.8,320,1034,320,997,320C960,320,923,320,886,320C849.2,320,812,320,775,320C738.5,320,702,320,665,320C627.7,320,591,320,554,320C516.9,320,480,320,443,320C406.2,320,369,320,332,320C295.4,320,258,320,222,320C184.6,320,148,320,111,320C73.8,320,37,320,18,320L0,320Z"></path>
                            </svg>
                        </div>
                        <h5 className="q-card4-profit">14%+</h5>
                    </div>
                </div>

            </div>
            {
                featuresDB.map(item => (
                    <MiniChart {...item} key={item.id} />
                ))
            }
            <ComposedCharts charts={data} title="سود ناخالص" barcolor="#00d6c2" linecolor="#e532c9" />
            <BarCharts chart={ChartData} title="سود جاری" colorchart="#fd9300" />
        </div>
    )
}
