const EmailsData = [
    {id:1,title:"علی",desc:"سلام و وقت بخیر ما برای...",date:"5 آبان"},
    {id:2,title:"حمید",desc:"سلام و وقت بخیر ما برای...",date:"12 تیر"},
    {id:3,title:"حسین",desc:"سلام و وقت بخیر ما برای...",date:"4 فروردین"},
    {id:4,title:"سعید",desc:"سلام و وقت بخیر ما برای...",date:"9 اردیبهشت"},
    {id:5,title:"سارا",desc:"سلام و وقت بخیر ما برای...",date:"23 مرداد"},
    {id:6,title:"ناصر",desc:"سلام و وقت بخیر ما برای...",date:"14 دی"},
    {id:7,title:"حمید",desc:"سلام و وقت بخیر ما برای...",date:"18 آبان"},
    {id:8,title:"حسن",desc:"سلام و وقت بخیر ما برای...",date:"30 خرداد"},
]



export default EmailsData